app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Dirty Harry"], ["rating", "R"], ["release_date", "1971-12-22 00:00:00.000000"], ["created_at", "2015-10-22 19:58:53.217122"], ["updated_at", "2015-10-22 19:58:53.217122"]]
---
  def add_tmdb

    if params["tmdb_movies"] == nil
      flash[:warning] = "No movies selected"
    else
      @tmdb_ids = params["tmdb_movies"].keys
      @tmdb_ids.each do |id|
        Movie.create_from_tmdb(id)